// import io from "socket.io-client";
// export const socket = io.connect("http://localhost:4000");

export const DEFAULT_MESSAGE = [
  {
    login: "Добро пожаловать в чат!",
    message: "Здесь пока нет сообщений"
  }
];

export const DISCIPLINES = [
  "Основы программирования",
  "Базы данных",
  "Сети и телекоммуникации",
  "Операционные системы",
  "Защита информации",
  "Программирование на основе классов и шаблонов",
  "Базовые компоненты интернет-технологий",
  "Разработка интернет-приложений",
  "Системное программирование",
  "Модели данных",
  "Архитектура автоматизированных систем обработки информации и управления",
  "Беспроводные технологии передачи данных",
  "Методы поддержки принятия решений",
  "Элементы управления в автоматизированных системах обработки информации",
  "Распределенные системы обработки информации и блокчейн технологии",
  "Технологии обработки больших данных",
  "Основы машинного обучения"
];

export const LECTORS = [
  {
    text: "Вершинин Евгений Владимирович заведующий кафедрой (кандидат физико-математических наук)",
    photoURL: "/images/lector.png"
  },
  {
    text: "Вершинин Евгений Владимирович заведующий кафедрой (кандидат физико-математических наук)",
    photoURL: ""
  },
  {
    text: "Вершинин Евгений Владимирович заведующий кафедрой (кандидат физико-математических наук)",
    photoURL: ""
  },
  {
    text: "Вершинин Евгений Владимирович заведующий кафедрой (кандидат физико-математических наук)",
    photoURL: ""
  },
  {
    text: "Вершинин Евгений Владимирович заведующий кафедрой (кандидат физико-математических наук)",
    photoURL: ""
  },
  {
    text: "Вершинин Евгений Владимирович заведующий кафедрой (кандидат физико-математических наук)",
    photoURL: ""
  },
  {
    text: "Вершинин Евгений Владимирович заведующий кафедрой (кандидат физико-математических наук)",
    photoURL: ""
  },
  {
    text: "Вершинин Евгений Владимирович заведующий кафедрой (кандидат физико-математических наук)",
    photoURL: ""
  },
];

export const TECHNOLOGIES = [
  {
    type: "front",
    name: "js",
    photo: ""
  },
  {
    type: "front",
    name: "js",
    photo: ""
  },
  {
    type: "front",
    name: "js",
    photo: ""
  },
  {
    type: "front",
    name: "js",
    photo: ""
  },
  {
    type: "front",
    name: "js",
    photo: ""
  },
  {
    type: "front",
    name: "js",
    photo: ""
  },
  {
    type: "front",
    name: "js",
    photo: ""
  },
  {
    type: "back",
    name: "js",
    photo: ""
  },
  {
    type: "back",
    name: "js",
    photo: ""
  },
  {
    type: "back",
    name: "js",
    photo: ""
  },
  {
    type: "back",
    name: "js",
    photo: ""
  },
  {
    type: "back",
    name: "js",
    photo: ""
  },
  {
    type: "tool",
    name: "js",
    photo: ""
  },
  {
    type: "tool",
    name: "js",
    photo: ""
  },
  {
    type: "tool",
    name: "js",
    photo: ""
  },
  {
    type: "tool",
    name: "js",
    photo: ""
  },
  {
    type: "back",
    name: "js",
    photo: ""
  }
];
